app/controllers/match_histories_controller.rb

SELECT "match_histories".* FROM "match_histories" WHERE "match_histories"."team_id" IS NOT NULL ORDER BY ABS(goal_out - goal_in) ASC
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20)
---
  def index
    match_histories = MatchHistory.includes(:team).where.not(team_id: nil).order('ABS(goal_out - goal_in) ASC')